In [2]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('student_data.db')
cursor = conn.cursor()

In [4]:
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
  id INTEGER PRIMARY KEY AUTOINCREMENT,
  name TEXT,
  age INTEGER,
  marks INTEGER
)
''')
conn.commit()

In [5]:
students = [
    ('John', 21, 85),
    ('Aisha', 22, 91),
    ('Kumar', 20, 78),
    ('Sara', 23, 88),
]

cursor.executemany('INSERT INTO students (name, age, marks) VALUES (?,?,?)', students)
conn.commit()

In [6]:
df = pd.read_sql_query("SELECT * FROM students", conn)
df

   id   name  age  marks
0   1   John   21     85
1   2  Aisha   22     91
2   3  Kumar   20     78
3   4   Sara   23     88

In [8]:
# Find students with marks > 80
df_high = pd.read_sql_query("SELECT * FROM students WHERE marks > 80", conn)
df_high

   id   name  age  marks
0   1   John   21     85
1   2  Aisha   22     91
2   4   Sara   23     88

In [10]:
# Average marks
df_avg = pd.read_sql_query("SELECT AVG(marks) AS average_marks FROM students", conn)
df_avg

   average_marks
0           85.5